import matplotlib.pyplot as plt
from numpy import sin, cos, tan, arcsin, arccos, arctan
import numpy as np

intoduction ='''
РОЗРАХУНКОВО-ГРАФІЧНА РОБОТА з дисципліни: «Програмування» 1-й семестр
На тему: "Програма розв’язання системи нелінійних рівнянь графічним методом"
Варіант 9
Керівник: Олефір О.С.
Виконала студентка групи КМ-02: Карачун Анастасія'''

description = '''
Програма призначена розв’язувати системи нелінійних рівнянь графічним методом.
Користувач вводить частини рівнянь системи, що містять в собі невідоме.
Програма обчислює корені системи рівнянь графічним методом, поступово зменшуючи інтервал побудови графіків 
поблизу точки перетину функцій, та повертає відповідне значення округлене до двох знаків після коми, 
а також на екрані виводиться графік перетину двох функцій.
Після чого користувач може ввести іншу систему рівнянь і програма почне свою роботу знову, 
аж поки користувач не захоче вийти з програми.'''

requirements = '''
ВИМОГИ ДО ВВЕДЕННЯ
Для корректного вводу функції використовуйте наступні оператори:
"+" - оператор додавання
"-" - оператор віднімання
"*" - оператор множення
"/" - оператор ділення. 
"**" - зведення в степінь, наприклад x**3 - це х в кубі
"pi" - число пі. Наприклад, cos(x+pi/2)
log(x, e) - логарифм за основою e вираза в дужках. Наприклад, log(3*x, 2) - логарифм з основою 2 числа 2x.
    Другий параметр можна опустити, тоді це буде натуральний логарифм.
sin(x), cos(x), tan(x) - функції синус, косинус і тангенс від x відповідно.
arcsin(x), arccos(x), arctan(x) - функції арксинус, арккосинус і арктангенс від x відповідно.
Помітка: складні вирази потрібно брати в дужки'''

print(intoduction)
print('_'*30)
print(description)
print('_'*30)
print(requirements)
print('_'*30)


while True:

    def check(f, x):
        return (lambda x: f)(x)


    try:
        f = input("Введіть перше рівняння:\n")
        f1 = input("Введіть друге рівняння:\n")
        x = np.linspace(-10, 10, 201)
        f_1 = eval('lambda x: ' + f)
        f_2 = eval('lambda x: ' + f1)
        y = f_1(x)
        y1 = f_2(x)
        k = 0
        for i in range(len(y)):
            #print(x[i], abs(y1[i] - y[i]))
            if abs(y1[i] - y[i]) < 0.1:
                print("Отримані корені:", "x =", round(x[i], 2), " f1(x) =", round(y[i], 2), " f2(x) =", round(y1[i], 2))
                k += 1
        if k==0:
            print("Ця система рівнянь коренів не має!")
        plt.plot(x, y, label=f)
        plt.plot(x, y1, label=f1)
        plt.legend()
        plt.title("Система рівнянь")
        plt.show()

    except Exception:
        print("Неправильний формат введених даних")

    str = input("Якщо хочете продовжити роботу в програмі, введіть 'yes', в іншому випадку введіть будь-який символ: ")
    if str != 'yes':
        print('Програма завершує свою роботу!\nДо нових зустрічей!')
        break
    print()