# Імпорт модуля для виконання математичних операцій.

# Виведення загальної інформації.
description = '''
Програма призначена обчислювати визначені інтеграли за формулою трапецій.
Користувач вводить підінтегральну формулу аналітичним способом, межі інтегрування та кількість розбиттів інтегралу.
Програма обчислює площу визначеного інтегралу та повертає відповідне значення округлене до двох знаків після коми.
Після чого користувач може ввести іншу функцію і програма почнеться знову, аж поки користувач не захоче вийти з програми.'''

requirements = """
ВИМОГИ ДО ВВЕДЕННЯ
Для корректного вводу функції використовуйте наступні оператори:
"+" - оператор додавання
"-" - оператор віднімання
"*" - оператор множення
"/" - оператор ділення. Помітка: складні вирази потрібно брати в дужки: (sqrt(x) - 1)/(sqrt(x^2 - x - 1)+x**2)
"**" - зведення в степінь, наприклад x**3 - це х в кубі
"pi" - число пі. Наприклад, cos(x+pi/2)
sqrt(x) - квадратний корінь з вираза в дужках. Наприклад, sqrt(x**3) - квадратний корінь з x в кубі
log(x, e) - логарифм за основою e вираза в дужках. Наприклад, log(2*x, 2) - логарифм з основою 2 числа 2x.
    Другий параметр можна опустити, тоді це буде натуральний логарифм.
sin(x), cos(x), tan(x) - функції синус, косинус і тангенс від x відповідно.
asin(x), acos(x), atan(x) - функції арксинус, арккосинус і арктангенс від x відповідно.
    
Приклади: sqrt(x)/(x + 1), x*log(x, 10), (x**2 - 1)/(x**3 + 1)"""

print('РОЗРАХУНКОВО-ГРАФІЧНА РОБОТА з дисципліни: «Програмування» 1-й семестр\n'
      'На тему: "Програма обчислення визначених інтегралів за квадратурними формулами (формули трапецій)"\n'
      'Варіант 25\n'
      'Керівник: Олефір О.С.\n'
      'Виконав студент КМ-02: Шиш Олександр')
print('_' * 25)

print(description)
print('_' * 25)

print(requirements)
print('_' * 25)

# Цикл, що дозволяє повторно використовувати програму, не виходячи з неї.
while True:
    # Введення даних та їх валідація.
    while True:
        try:
            a = float(input('\nВведіть нижню межу інтеграла: '))
            break
        except ValueError:
            print("Введене значення повинне бути числом")

    while True:
        try:
            b = float(input('Введіть верхню межу інтеграла: '))
            break
        except ValueError:
            print("Введене значення повинне бути числом")

    while True:
        try:
            global f
            f = input('\nВведіть функцію, дотримуючись вище наведених правил: ')
            check = eval('lambda x: ' + f)
            for i in range(int(a), int(b) + 1):
                check(i)
            break
        except ZeroDivisionError:
            print('Введена функція містить ділення на нуль. Введіть іншу функцію, дотримуючись наведених вище правил.')

        except ValueError:
            print('Введена функція не є дійсною.')
            print('Перевірте правильність введення та введіть іншу функцію, дотримуючись наведених вище правил.')
        except:
            print('Введена функція не є дійсною.')
            print('Перевірте правильність введення та введіть іншу функцію, дотримуючись наведених вище правил.')

    while True:
        try:
            n = int(input('Введіть число розбиття інтеграла(чим більше число, тим більша точність): '))
            if n != 0:
                break
            else:
                raise ValueError
        except ValueError:
            print("Введене значення повинне бути цілим додатнім числом числом")

    # Основна частина програми.
    # Функція, яка обчислює площу інтеграла.
    def calc_integral(f, a, b, n=100):
        s = 0
        h = (b - a) / n
        x = a + h
        F = eval('lambda x: ' + f)

        while x < b:
            s += F(x)
            x += h

        f_a = F
        f_b = F

        s = (h / 2) * (f_a(a) + f_b(b) + 2 * s)

        print('_' * 25)
        print('\nРезультат:')

        return print("\nПлоща введеної підінтегральної функції на вказаних межах дорівнює " + str(round(s, 2)))


    # Обробка помилок.
    try:
        calc_integral(f, a, b, n)
    except ZeroDivisionError:
        print('Введена функція містить ділення на нуль, що викликало помилку.'
              ' Введіть іншу функцію, дотримуючись наведених вище правил.')
        continue
    except ValueError:
        print('Введена функція містить неможливу дію, наприклад, корень з від\'ємного числа або логарифм з нуля.')
        continue

    # Запит на продовження роботи.
    print('_' * 25)
    exit_or_repeat = input(
        '\nЩоб спробувати знову введіть 1, щоб завершити роботу введіть 0: ')

    while exit_or_repeat != '1' and exit_or_repeat != '0':
        exit_or_repeat = input("Ви ввели некоректні дані. Потрібно ввести 0 або 1: ")

    if exit_or_repeat == '0':
        print('До зустрічі!')
        break
